<?xml version="1.0" encoding="utf-8"?>
<!-- (c) 2023 swjm.blog -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
	<displayName>enter display name here</displayName>
	<description>enter description here</description>
	<resources>
		<stringTable>
			<string id="category_yubico">Yubico</string>
			<string id="category_yubikey">YubiKey Removal Behavior</string>
			<string id="LockOrLogoutWorkstationOnYubiKeyRemoval">YubiKey Removal Behavior</string>
			<string id="LockOrLogoutWorkstationOnYubiKeyRemoval_Help">This policy setting allows you to control whether the workstation should lock if a YubiKey is removed or the user(s) be logged out.

OPTIONS:
-----------
- Lock workstation
- Log out user(s)
- Do nothing (disabled)


NOTE: For the setting to take effect you will need to also install the 'YubiKey Removal Behavior' tool on target system(s).

</string>
			<!-- version 2.0 -->
			<string id="Lock">Lock workstation</string>
			<string id="Logout">Log out user(s)</string>
			<string id="doNothing">Do nothing</string>
		</stringTable>
		<presentationTable>
			<presentation id="StateSelection">
				<dropdownList refId="StateSelect" noSort="true" defaultItem="0">Select removal response:</dropdownList>
			</presentation>
		</presentationTable>
	</resources>
</policyDefinitionResources>
